---
title: ProjectInfo
classe: Autodesk.Revit.DB.ProjectInfo
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ProjectInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Address { get; set; }` | `projectInfo.Address` | String |
| `String Author { get; set; }` | `projectInfo.Author` | String |
| `String BuildingName { get; set; }` | `projectInfo.BuildingName` | String |
| `String ClientName { get; set; }` | `projectInfo.ClientName` | String |
| `String IssueDate { get; set; }` | `projectInfo.IssueDate` | String |
| `String Name { get; set; }` | `projectInfo.Name` | String |
| `String Number { get; set; }` | `projectInfo.Number` | String |
| `String OrganizationDescription { get; set; }` | `projectInfo.OrganizationDescription` | String |
| `String OrganizationName { get; set; }` | `projectInfo.OrganizationName` | String |
| `String Status { get; set; }` | `projectInfo.Status` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```